ibrahim-isikli/STM32f4-Discovery--SPL----Tescom-Staj/STM32_workspace_9.3/016_STDP_MULTI_EXTI_Ex1/src/main.c

#include "stm32f4xx.h"
#include "stm32f4_discovery.h"

void RCC_Config(void);
void GPIO_Config(void);
void EXTI_Config(void);
void NVIC_Config(void);
void delay (uint32_t);
void EXTI3_IRQHandler(void);
void EXTI4_IRQHandler(void);





GPIO_InitTypeDef GPIO_InitStruct;
EXTI_InitTypeDef EXTI_InitStruct;
NVIC_InitTypeDef NVIC_InitStruct;


void RCC_Config(void){

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD,ENABLE);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG,ENABLE);
}

void GPIO_Config(void){

	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Pin = (GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_Init(GPIOD, &GPIO_InitStruct);

	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Pin =(GPIO_Pin_3 | GPIO_Pin_4);
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_Init(GPIOA, &GPIO_InitStruct);

}

void EXTI_Config(void){

	EXTI_InitStruct.EXTI_Line = (EXTI_Line3 | EXTI_Line4);
	EXTI_InitStruct.EXTI_LineCmd =ENABLE;
	EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising;
	EXTI_Init(&EXTI_InitStruct);
}

void NVIC_Config(void){

	// NVIC Grpup Config
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);

	/*    NVIC_PriorityGroup_1:
	 1 bits for pre-emption priority
     3 bits for subpriority      */

	NVIC_InitStruct.NVIC_IRQChannel = EXTI3_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;  // oncelik en yuksek -> EXTI3
	NVIC_InitStruct.NVIC_IRQChannelSubPriority =0;
	NVIC_Init(&NVIC_InitStruct);

	NVIC_InitStruct.NVIC_IRQChannel = EXTI4_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 1; // onceligi dusuk
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStruct);
}

void delay (uint32_t time){
	while(time--);
}

void EXTI3_IRQHandler(void){

	// flag kontrol
	if(EXTI_GetITStatus(EXTI_Line3) != RESET){

		GPIO_ResetBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);
		GPIO_SetBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_14);
		delay(16800000);
		GPIO_ResetBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_14);
		delay(16800000);
		GPIO_SetBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_14);
		delay(16800000);
		GPIO_ResetBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_14);
		delay(16800000);

		EXTI_ClearITPendingBit(EXTI_Line3);
	}
}

void EXTI4_IRQHandler(void){

	// flag kontrol
	if(EXTI_GetITStatus(EXTI_Line4) != RESET){


		GPIO_ResetBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);
		GPIO_SetBits(GPIOD, GPIO_Pin_13 | GPIO_Pin_15);
		delay(16800000);
		GPIO_ResetBits(GPIOD, GPIO_Pin_13 | GPIO_Pin_15);
		delay(16800000);
		GPIO_SetBits(GPIOD, GPIO_Pin_13 | GPIO_Pin_15);
		delay(16800000);
		GPIO_ResetBits(GPIOD, GPIO_Pin_13 | GPIO_Pin_15);
		delay(16800000);

		EXTI_ClearITPendingBit(EXTI_Line4); // flag clear
	}
}



int main(void)
{
  RCC_Config();
  GPIO_Config();
  EXTI_Config();
  NVIC_Config();

  while (1)
  {
	GPIO_ResetBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);

  }
}



void EVAL_AUDIO_TransferComplete_CallBack(uint32_t pBuffer, uint32_t Size){
  /* TODO, implement your code here */
  return;
}

/*
 * Callback used by stm324xg_eval_audio_codec.c.
 * Refer to stm324xg_eval_audio_codec.h for more info.
 */
uint16_t EVAL_AUDIO_GetSampleCallBack(void){
  /* TODO, implement your code here */
  return -1;
}
